In [2]:
# 제 1유형
# 문제 1-1.
# 다음은 학생 10명의 과목별 점수 데이터이다.
# 점수 데이터의 결측치를 제거한 후, 학생들이 가장 많이 듣는 과목의 점수를
# 표준화 한 후 Z-score의 최대값을 반올림하여 소수점 둘째 자리까지 구하시오
# 데이터 생성 (수정금지)
import pandas as pd
import numpy as np
df = pd.DataFrame( {
'과목': ['국어','국어', '수학','수학','영어', '영어','영어','영어','영어','영어'],
'점수' : [72, 75, 80, 72, 65, 72, 80, 75, 92, None]})
df.head(10)

   과목    점수
0  국어  72.0
1  국어  75.0
2  수학  80.0
3  수학  72.0
4  영어  65.0
5  영어  72.0
6  영어  80.0
7  영어  75.0
8  영어  92.0
9  영어   NaN

In [4]:
df = df.dropna(axis=0)
df['과목'].value_counts()

과목
영어    5
국어    2
수학    2
Name: count, dtype: int64

In [5]:
english = df[df['과목']=='영어'].copy()
english

   과목    점수
4  영어  65.0
5  영어  72.0
6  영어  80.0
7  영어  75.0
8  영어  92.0

In [6]:
mean = english['점수'].mean()
std = english['점수'].std()
english['점수'] = ( english['점수'] - mean ) / std
english

   과목        점수
4  영어 -1.170096
5  영어 -0.475971
6  영어  0.317314
7  영어 -0.178489
8  영어  1.507242

In [7]:
max = english['점수'].max()
print(round(max,2))

1.51

In [8]:
# 문제 1-2.
# mtcars 데이터셋에서 mpg와 상관관계가 가장 큰 변수를 선정하고
# 그 변수의 평균값을 반올림하여 정수로 출력하시오.
# 데이터 생성 (수정금지)
import pandas as pd
import numpy as np
df = pd.read_csv("./mtcars.csv")
df = df[['mpg','disp','hp', 'wt', 'qsec']]
df.head()

    mpg   disp   hp     wt   qsec
0  21.0  160.0  110  2.620  16.46
1  21.0  160.0  110  2.875  17.02
2  22.8  108.0   93  2.320  18.61
3  21.4  258.0  110  3.215  19.44
4  18.7  360.0  175  3.440  17.02

In [9]:
corr = df.corr()
corr

           mpg      disp        hp        wt      qsec
mpg   1.000000 -0.847551 -0.776168 -0.867659  0.418684
disp -0.847551  1.000000  0.790949  0.887980 -0.433698
hp   -0.776168  0.790949  1.000000  0.658748 -0.708223
wt   -0.867659  0.887980  0.658748  1.000000 -0.174716
qsec  0.418684 -0.433698 -0.708223 -0.174716  1.000000

In [ ]:
print((abs(corr['mpg']).sort_values(ascending=False)))
# (mpg변수와 상관관계가 가장 큰 변수는 wt)

mpg     1.000000
wt      0.867659
disp    0.847551
hp      0.776168
qsec    0.418684
Name: mpg, dtype: float64

In [17]:
print(round(df['wt'].mean()))

3

In [19]:
# 문제 1-3.
# wt컬럼에 대해 상자그림 기준으로 이상치의 개수를 구하시오. 

df = pd.read_csv("./mtcars.csv")
df.head()

,car,mpg,cyl,disp,hp,drat,wt,qsec,vs,am,gear,carb
0,Mazda RX4,21.0,6,160.0,110,3.90,2.620,16.46,0,1,4,4
1,Mazda RX4 Wag,21.0,6,160.0,110,3.90,2.875,17.02,0,1,4,4
2,Datsun 710,22.8,4,108.0,93,3.85,2.320,18.61,1,1,4,1
3,Hornet 4 Drive,21.4,6,258.0,110,3.08,3.215,19.44,1,0,3,1
4,Hornet Sportabout,18.7,8,360.0,175,3.15,3.440,17.02,0,0,3,2

In [21]:
q1 = df['wt'].quantile(.25)
q3 = df['wt'].quantile(.75)
iqr = q3 - q1
upper = q3 + iqr*1.5
lower = q1 - iqr*1.5

cond1 = (df['wt'] > upper)
cond2 = (df['wt'] < lower)

len(df[cond1|cond2])

3